Internet Working Group                                       Y. Jiang
                                                               Y. Luo
Internet Draft                                                 Huawei

Intended status: Standards Track




Expires: April 2014                                   October 21, 2013



                    Multi-chassis PON Protection in MPLS
                       draft-jiang-pwe3-mc-pon-00.txt


Status of this Memo

   This Internet-Draft is submitted to IETF in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html

   This Internet-Draft will expire on April 21, 2013.

Copyright Notice

   Copyright (c) 2013 IETF Trust and the persons identified as the
   document authors. All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must



Jiang, et al           Expires April 21, 2014                 [Page 1]

Internet-Draft            MC-PON Protection               October 2013


   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Abstract

   While MPLS is deployed further and further to the access network, a
   converging network edge point which provides both MPLS and PON access
   capability appears. To provide resiliency for its services, multi-
   homing is needed to support PON access in MPLS. This document
   describes the multi-chassis PON protection architecture in MPLS and
   also proposes the ICCP extension to support it.

Table of Contents

   1.   Conventions used in this document ......................... 2
   2.   Terminology ............................................... 3
   3.   Introduction .............................................. 3
      3.1. Multi-chassis PON Application TLVs ..................... 5
      3.1.1.  PON Connect TLV ..................................... 5
      3.1.2.  PON Disconnect TLV .................................. 6
      3.1.3.  PON Configuration TLV ............................... 6
      3.1.4.  PON State TLV ....................................... 7
   4.   Dual Homing protection procedures ......................... 8
      4.1. Protection procedure upon PON interface failures ....... 9
      4.2. Protection procedure upon PW failures .................. 9
      4.3. Protection procedure upon the working OLT failure ...... 9
   5.   Security Considerations .................................. 10
   6.   IANA Considerations ...................................... 10
   7.   References ............................................... 10
      7.1. Normative References .................................. 10
      7.2. Informative References ................................ 10
   8.   Acknowledgments .......................................... 10
   Authors' Addresses ............................................ 11



1. Conventions used in this document

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].







Jiang, et al           Expires April 21, 2014                 [Page 2]

Internet-Draft            MC-PON Protection               October 2013


2. Terminology

   FTTx Fiber-to-the-x (FTTx, x = H for home, P for premises, C for curb)

   ICCP Inter-Chassis Communication Protocol

   OLT Optical Line Termination

   ONU Optical Network Unit

   MPLS Multi-Protocol Label Switching

   PON Passive Optical Network

3. Introduction

   MPLS is extending further and further to the edge of networks, for
   example, the seamless MPLS use cases as described in [SEAMLESS], and
   the MS-PW with PON access use case as described in [RFC6456], all
   show that MPLS is approaching the access networks.

   Passive Optical Network (PON) can provide high bandwidth of 1Gbps or
   even 10Gbps, and provide support of access for dozens to more than
   one hundred subscribers at the same time. A huge number of PON access
   networks have been deployed over the last few years with the wide
   spread of FTTx technology.

   With the fast growth of mobile data traffic, more and more LTE small
   cells and Wi-Fi hotspots will be deployed in the future. How to
   backhaul a large number of small cells or hotspots will pose a great
   challenge to mobile service providers.

   PON access technology has the following advantages:

   -saving trunk fibers with its point-to-multipoint physical topology;

   -High bandwidth capability up to 10Gbps;

   -Low Total Cost of Ownership (TCO).

   PON also provides synchronization features, e.g., SyncE and IEEE1588
   functionality, which can fulfill synchronization needs of mobile
   backhaul services. Some optical layer of protection mechanisms, such
   as Type B protection and Type C protection are also specified [G983.1]
   to avoid single point of failure in the access.




Jiang, et al           Expires April 21, 2014                 [Page 3]

Internet-Draft            MC-PON Protection               October 2013


   Therefore, PON may play a greater role in the access end for the
   mobile backhaul networks. Providing OLTs with MPLS functionality
   further facilitates multi-service convergence.

   Type B protection architecture is an economical PON resiliency
   mechanism, where the working OLT and the working link between the
   working splitter and the working OLT (i.e., the working fiber) is
   protected by a redundant protection OLT and a redundant fiber between
   the working splitter and the protection OLT. This is different from
   the more complex and costly Type C protection architecture where
   working splitter and the working fibers from ONUs to the working
   splitter are further protected. Figure 1 demonstrates a typical
   scenario of Type B PON protection.

                        |                                 |
                        |<--Optical Distribution Network->|
                        |                                 |
                        |   branch               trunk    +-----+
                  +-----+   fibers               fibers   |     |
   Base     ------|     |     |                           . OLT |
   Stations ------| ONU |\    |                        ,'`|  A  |
            ------|     |  \  V                     _-`   +-----+
                  +-----+    \                    .'
                            .  \  +----------+ ,-`
                  +-----+   .    \|          -`   Working
   Base     ------|     |   .     | Optical  |
   Stations ------| ONU |---------| Splitter |
            ------|     |   .    /|          -,   Protection
                  +-----+   .  /  +----------+ `'.,
                             /                     `-,    +-----+
                  +-----+  /                          `'.,|     |
   Base     ------|     |/                                | OLT |
   Stations ------| ONU |                                 |  B  |
            ------|     |                                 +-----+
                  +-----+
                Figure 1 Type B PON protection Architecture



   Though the above PON architecture provides redundancy in its physical
   topology, some standard mechanisms are needed to exchange PON link
   status and network status between OLTs in a Redundancy Group (RG) so
   that protection and restoration can be done reliably, especially when
   the OLTs also support MPLS. Thus there is a need for Multi-chassis
   PON protection protocol in MPLS.




Jiang, et al           Expires April 21, 2014                 [Page 4]

Internet-Draft            MC-PON Protection               October 2013


   ICCP [ICCP] provides a framework for inter-chassis synchronization of
   state and configuration data between a set of two or more PEs.
   Currently ICCP only defines application specific messages for PW
   redundancy and mLACP, but it can be easily extended to support Type B
   PON as an Attachment Circuit (AC) redundancy.

   This document proposes the extension of ICCP to support Multi-chassis
   PON protection in MPLS.



3.1. Multi-chassis PON Application TLVs

   A set of multi-chassis PON application TLVs are defined in the
   following sub-sections.

3.1.1. PON Connect TLV

   This TLV is included in the RG Connect message to signal the
   establishment of PON application connection.

   0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |U|F|   Type=0x00XX             |    Length                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      Protocol Version         |A|         Reserved            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                    Optional Sub-TLVs                          |
   ~                                                               ~
   |                                                               |
   +                                 +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |             ...                 |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   - U and F Bits, both are set to 0.

   - Type, set to 0x00XX for "PON Connect TLV".

   - Length, Length of the TLV in octets excluding the U-bit, F-bit,
   Type, and Length fields.

   - Protocol Version, the version of this PON specific protocol for the
   purposes of inter-chassis communication. This is set to 0x0001.

   - A Bit, Acknowledgement Bit. Set to 1 if the sender has received a
   PON Connect TLV from the recipient. Otherwise, set to 0.



Jiang, et al           Expires April 21, 2014                 [Page 5]

Internet-Draft            MC-PON Protection               October 2013


   - Reserved, Reserved for future use.

   - Optional Sub-TLVs, there are no optional Sub-TLVs defined for this
   version of the protocol.

3.1.2. PON Disconnect TLV

   This TLV is included in the RG Disconnect message to indicate that
   the connection for the PON application is to be terminated.

   0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |U|F|   Type=0x00XX             |    Length                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                       Optional Sub-TLVs                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   - U and F Bits, both are set to 0.

   - Type, set to 0x00XX for "PON Disconnect TLV".

   - Length, Length of the TLV in octets excluding the U-bit, F-bit,
   Type, and Length fields.

   - Optional Sub-TLVs, there are no optional Sub-TLVs defined for this
   version of the protocol.

3.1.3. PON Configuration TLV

   0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |U|F|   Type=0x00XX             |    Length                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                         System ID                             |
   +                               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                               |         System Priority       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |             Port ID           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   - U and F Bits, both are set to 0.

   - Type, set to 0x00XX for "PON Configuration TLV".


Jiang, et al           Expires April 21, 2014                 [Page 6]

Internet-Draft            MC-PON Protection               October 2013


   - Length, Length of the TLV in octets excluding the U-bit, F-bit,
   Type, and Length fields.

   - System ID, 6 octets encoding the System ID used by the OLT, which
   is a MAC address.

   - System Priority, 2 octets encoding the System Priority.

   - Port ID, 2 octets PON Port ID.

   Further configuration considerations such as multicast table and ARP
   table for static MAC addresses will be added in a next version.

3.1.4.PON State TLV

   0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |U|F|   Type=0x00XX             |    Length                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                              ROID                             |
   |                                                               |
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                    Local PON Port state                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                   Remote PON Port state                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   - U and F Bits, both are set to 0.

   - Type, set to 0x00XX for "PON State TLV"

   - Length, Length of the TLV in octets excluding the U-bit, F-bit,
   Type, and Length fields.

   - ROID, as defined in the ROID section of [ICCP].

   - Local PON Port State, the status of the local PON port as
   determined by the sending OLT (PE). The last bit is defined as Fault
   indication of the PON Port associated with this PW.

   - Remote PON Port State, the status of the remote PON port as
   determined by the remote peer of the sending OLT (PE). The last bit
   is defined as Fault indication of the PON Port associated with this
   PW.


Jiang, et al           Expires April 21, 2014                 [Page 7]

Internet-Draft            MC-PON Protection               October 2013


4. Dual Homing protection procedures

   Two typical MPLS protection network architectures for PON access are
   depicted in Fig.2 and Fig.3 (PON access segment is the same as in
   Fig.1 and thus omitted for simplification). OLTs with MPLS
   functionality are connected to a single PE (Fig.2) or dual home PEs
   (Fig.3) respectively, thus these devices constitute an MPLS network
   which provides PW transport services between ONUs and a CE.
                  +-----+
                  |     |
                  | OLT -,
                  |     | `.,
                  +-----+    ',
                               `',
                                  `.,   +-----+          +-----+
                                     ', |     |          |     |
                                       `.  PE ------------  CE |
                                     .'`|     |          |     |
                                  ,-`   +-----+          +-----+
                                .`
                  +-----+    .'`
                  |     | ,-`
                  | OLT -`
                  |     |
                  +-----+
                 Figure 2 An MPLS network with a single PE


                  +-----+               +-----+
                  |     |               |     |
                  | OLT -----------------  PE -,
                  |     |               |     | ',
                  +-----+               +--/--+   ',
                                           |        `.
                                           |          `. +-----+
                                           |            `'     |
                                           |             |  CE |
                                           |             .     |
                                           |           ,'+-----+
                                           |        ,-`
                  +-----+               +--\--+   ,'
                  |     |               |     | .`
                  | OLT -----------------  PE -`
                  |     |               |     |
                  +-----+               +-----+
                Figure 3 An MPLS network with dual home PEs



Jiang, et al           Expires April 21, 2014                 [Page 8]

Internet-Draft            MC-PON Protection               October 2013



   Faults may be encountered in PON access, or in the MPLS network
   (including the working OLT). Procedures for these cases are described
   in this section (it is assumed that both OLTs and PEs are working in
   independent mode of PW redundancy [RFC6870]).

4.1. Protection procedure upon PON interface failures

   When a fault is detected on a working PON link, a working OLT MUST
   turn off its associated PON interface and MUST send an LDP
   notification message with a forward defect indication and with the
   Request Switchover bit being set to its peer PE on the remote end of
   the PW.  At the same time, the working OLT MUST send an ICCP message
   with PON State TLV to notify the backup OLT of the PON fault.
   Upon receiving a PON state TLV where Local PON Port state is False,
   an OLT in the protection mode MUST activate the protection PON link
   in the protection group.


4.2. Protection procedure upon PW failures

   Usually MPLS networks have its own protection mechanism such as LSP
   protection or Fast Reroute (FRR). But in a link sparse access or
   aggregation network where protection is impossible in LSP layer, the
   following PW layer protection procedures can be enabled.

   When a fault is detected on its working PW (e.g., by VCCV BFD), a
   working OLT MUST turn off its associated PON interface and MUST send
   an ICCP message with PON State TLV to notify the backup OLT of the
   PON fault.

   Upon receiving a PON state TLV where Local PON Port state is False,
   the backup OLT MUST activate its optical interface to the backup
   fiber. At the same time, the backup OLT MUST send a PW redundancy
   message to the remote PE, so that traffic can be switched to the
   backup PW.

4.3. Protection procedure upon the working OLT failure

   If the backup OLT lost connection to the working OLT, it MUST
   activate its optical interface to the back fiber and activate the
   specific backup PW upon receiving a PW redundancy message from its
   remote PE with the Request Switchover bit being set, so that traffic
   can be reliably switched to the protection link and the backup PW.





Jiang, et al           Expires April 21, 2014                 [Page 9]

Internet-Draft            MC-PON Protection               October 2013


5. Security Considerations

   Security considerations as described in [ICCP] apply.

6. IANA Considerations

   These values are requested from the registry of "ICC RG parameter
   type":
   0x00X0         PON Connect TLV
   0x00X1         PON Disconnect TLV
   0x00X2         PON Configuration TLV
   0x00X3         PON State TLV

7. References

7.1.  Normative References

   [RFC2119] Bradner, S., "Key words for use in RFCs to Indicate
             Requirement Levels", BCP 14, RFC 2119, March 1997

   [RFC6870] Muley, P., Aissaoui, M., "Pseudowire Preferential
             Forwarding Status Bit", RFC 6870, February 2013

7.2. Informative References

   [RFC6456] Li, H., Zheng, R., and Farrel, A., "Multi-Segment
             Pseudowires in Passive Optical Networks", RFC 6456,
             November 2011

   [SEAMLESS] Leymann, N., and et al, "Seamless MPLS Architecture",
             draft-ietf-mpls-seamless-mpls-04, Work in progress

   [ICCP] Martini, L. and et al, "Inter-Chassis Communication Protocol
             for L2VPN PE Redundancy", draft-ietf-pwe3-iccp-11, Work in
             progress

   [G983.1] ITU-T, "Broadband optical access systems based on Passive
             Optical Networks (PON)", ITU-T G.983.1, January, 2005

8. Acknowledgments

   TBD.







Jiang, et al           Expires April 21, 2014                [Page 10]

Internet-Draft            MC-PON Protection               October 2013


Authors' Addresses

   Yuanlong Jiang
   Huawei Technologies Co., Ltd.
   Bantian, Longgang district
   Shenzhen 518129, China
   Email: jiangyuanlong@huawei.com

   Yong Luo
   Huawei Technologies Co., Ltd.
   Bantian, Longgang district
   Shenzhen 518129, China
   Email: dennis.luoyong@huawei.com



































Jiang, et al           Expires April 21, 2014                [Page 11]

